# Операции с целыми числами

# 1_5_3
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
# 11111*1111111
print(11111 * 1111111)

# 1_5_5
# Составьте выражение для вычисления указанной ниже формулы
# и вставьте в поле ответа вывод интерпретатора после вычисления этого выражения.
# 42 / 4+2*(−2)
# На самом деле, Python 3 не может вычислить подобное выражение, поэтому возникнет ошибка.
# Впишите вывод интерпретатора Python 3 в поле для ответа.
print(42 / (4 + 2 * (-2)))

# 1_5_7
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
# 2014^14
#
# Заметьте, насколько большое это число.
# Во многих других языках программирования работать со значениями такого порядка гораздо сложнее.
print(2014 ** 14)