# Операции с вещественными числами

# 1_6_3
# Запишите число 1.2345e3 в виде десятичной дроби.
# См. экспоненциальная запись.
# 1.2345 * (10 ** 3) = 1.2345 * 10^3
print(1.2345e3)

# 1_6_4
# Запишите число 1.2345e-3 в виде десятичной дроби
# 1.2345 * (10 ** (-3))
print(1.2345e-3)

# 1_6_5
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
# 2014.0^14
# Обратите внимание на запись числа: это вещественное число.
print(2014.0 ** 14)

# 1_6_6
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
# 7/3
print(7/3)

# 1_6_7
# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
# 7//3
# Заметьте, что деление нацело работает также и с вещественными числами и соответствует
# делению с округлением в сторону −∞.
print(7//3)